app/controllers/sessions_controller.rb

  def create
    @email = params[:session][:email]
    @password = params[:session][:password]

    @user = User.find_by_email(@email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'tprentis@gmail.com' LIMIT 1