app/controllers/stocks_controller.rb

SELECT "stocks".* FROM "stocks" ORDER BY symbol LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM "stocks"
---
  def index

    @stocks = Stock.order(:symbol).page params[:page]

SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT 1  [["id", "31"]]
---
  def show
    @stock = Stock.find(params[:id])

SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT 1  [["id", "4"]]
---
  def edit
    @stock = Stock.find(params[:id])

INSERT INTO "stocks" ("created_at", "price", "quantity", "symbol", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 30 Oct 2012 14:47:05 UTC +00:00], ["price", 2.0], ["quantity", 2], ["symbol", "goog"], ["updated_at", Tue, 30 Oct 2012 14:47:05 UTC +00:00]]
---
  def create
    @stock = Stock.new(params[:stock])

    respond_to do |format|
      if @stock.save

SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT 1  [["id", "30"]]
UPDATE "stocks" SET "symbol" = 'DDDD', "updated_at" = '2012-10-30 23:44:12.466279' WHERE "stocks"."id" = 7
---
  def update
    @stock = Stock.find(params[:id])

    respond_to do |format|
      if @stock.update_attributes(params[:stock])

SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT 1  [["id", "30"]]
DELETE FROM "stocks" WHERE "stocks"."id" = ?  [["id", 30]]
---
  def destroy
    @stock = Stock.find(params[:id])
    @stock.destroy